[
  "A woman gets on a bus with her baby. The bus driver says: \"Ugh, that's the ugliest baby I've ever seen!\" The woman walks to the rear of the bus and sits down, fuming. She says to a man next to her: \"The driver just insulted me!\" The man says: \"You go up there and tell him off. Go on, I'll hold your monkey for you.\"",
  "I went to the zoo the other day, there was only one dog in it, it was a shitzu.",
  "Dyslexic man walks into a bra",
  "A young blonde woman is distraught because she fears her husband is having an affair, so she goes to a gun shop and buys a handgun. The next day she comes home to find her husband in bed with a beautiful redhead. She grabs the gun and holds it to her own head. The husband jumps out of bed, begging and pleading with her not to shoot herself. Hysterically the blonde responds to the husband, \"Shut up...you're next!\"",
  "A classic Tommy Cooper gag \"I said to the Gym instructor \"Can you teach me to do the splits?\" He said, \"How flexible are you?\" I said, \"I can't make Tuesdays\", was fifth.",
  "Police arrested two kids yesterday, one was drinking battery acid, the other was eating fireworks. They charged one - and let the other one off.",
  "Two aerials meet on a roof - fall in love - get married. The ceremony was rubbish - but the reception was brilliant.",
  "Another one was: Doc, I can't stop singing the 'Green Green Grass of Home'. He said: 'That sounds like Tom Jones syndrome'. 'Is it common?'I asked. 'It's not unusual' he replied.",
  "I'm on a whiskey diet. I've lost three days already.",
  "A man walks into a bar with a roll of tarmac under his arm and says: \"Pint please, and one for the road.\"",
  "I went to the doctors the other day and I said, 'Have you got anything for wind?' So he gave me a kite.",
  "My mother-in-law fell down a wishing well, I was amazed, I never knew they worked.",
  "I saw this bloke chatting up a cheetah; I thought, \"He's trying to pull a fast one\".",
  "A woman has twins, and gives them up for adoption. One of them goes to a family in Egypt and is named 'Amal.' The other goes to a family in Spain, they name him Juan'. Years later; Juan sends a picture of himself to his mum. Upon receiving the picture, she tells her husband that she wished she also had a picture of Amal. Her husband responds, \"But they are twins. If you've seen Juan, you've seen Amal.\"",
  "There's two fish in a tank, and one says \"How do you drive this thing?\"",
  "I went to buy some camouflage trousers the other day but I couldn't find any.",
  "When Susan's boyfriend proposed marriage to her she said: \"I love the simple things in life, but I don't want one of them for my husband\".",
  "My therapist says I have a preoccupation with vengeance. We'll see about that.",
  "I rang up British Telecom, I said, \"I want to report a nuisance caller\", he said \"Not you again\".",
  " I met a Dutch girl with inflatable shoes last week, phoned her up to arrange a date but unfortunately she'd popped her clogs."
]